[
    {
      "id": 1,
      "title": "Жизнь в большом городе",
      "description": "Жизнь в большом городе, когда ты не родился с серебряной ложкой",
      "dateCreate": "1652441799127",
      "dateUpdate": "1652441825793",
      "content": {
        "text": "Небольшая статья о проблемах с которыми ты можешь столкнуться в большом городе, не имея на счету пару миллионов рублей, а иногда и с ними",
        "image": ""
      },
      "authors": ["Разработчик: Иван Иванов", "Менеджер: Василий Петрович"],
      "departments": [
        "Отдел разработки 4"
      ],
      "tags": ["большой город", "нет денег", "сложная жизнь"],
      "category": "Логистика"
    },
    {
      "id": 2,
      "title": "Представления и движок представлений Handlebars",
      "description": "Как правило, приложения Express для определения визуального интерфейса использует не стандартные файлы html, а специальные сущности - представления, из которых затем создаются html-файлы.",
      "dateCreate": "1652442180701",
      "dateUpdate": "1652442200007",
      "content": {
        "text":  "Как правило, приложения Express для определения визуального интерфейса использует не стандартные файлы html, а специальные сущности - представления, из которых затем создаются html-файлы. Преимуществом представлений является то, что мы можем определять в них некоторые шаблоны, вместо которых затем вставляется какое-то динамическое содержимое с помощью кода javascript.\n Управляет представлениями специальный компонент - движок представлений (view engine), который также называют движок шаблонов (template engine). Вообще движков представлений в Express довольно много: Pug, Jade, Dust, Nunjucks, EJS, Handlebars и другие. Вопрос выбора движка представлений - в основном вопрос предпочтений, все они предоставляют схожую функциональность, различаясь лишь в каких-то деталях.",
        "image": ""
      },
      "authors": ["Разработчик: Саша Сашин", "Менеджер: Петр Петрович"],
      "departments": [
        "Отдел разработки 2"
      ],
      "tags": ["движок представлений", "handlebars", "backend"],
      "category": "Серверная сторона"
    },
    {
      "id": 3,
      "title": "Установка и администрирование базы данных",
      "description": "В этой и дальнейших статьях мы рассмотрим базовые операции с данными в MongoDB с примением как консольной оболочки mongo, так и графического клиента MongoDB Compass.",
      "dateCreate": "1652442449384",
      "dateUpdate": "1652442460870",
      "content": {
        "text":  "В этой и дальнейших статьях мы рассмотрим базовые операции с данными в MongoDB с примением как консольной оболочки mongo, так и графического клиента MongoDB Compass. Однако в любом случае при начале работы с сервером следует не забывать запускать сам сервер - то есть приложение mongod.\n Начиная работать с MongoDB в консольной оболочке mongo, первым делом надо установить нужную нам базу данных в качестве текущей, чтобы затем ее использовать. Для этого надо использовать команду use, после которой идет название базы данных. При этом не важно, существует ли такая бд или нет. Если ее нет, то MongoDB автоматически создаст ее при добавлении в нее данных.",
        "image": ""
      },
      "authors": ["Разработчик: Никита Никитин", "Менеджер: Петр Васильевич"],
      "departments": [
        "Отдел разработки 1"
      ],
      "tags": ["базы данных", "mongo", "backend"],
      "category": "Базы данных"
    },
    {
      "id": 4,
      "title": "Guards",
      "description": "Guards позволяют ограничить навигацию по определенным маршрутам. Например, если для доступа к определенному ресурсу требуется наличие аутентификации или наличие каких-то других условий, в зависимости от которых мы можем предоставить пользователю доступ, а можем и не предоставить.",
      "dateCreate": "1652443291162",
      "dateUpdate": "1652443299417",
      "content": {
        "text":  "Guards позволяют ограничить навигацию по определенным маршрутам. Например, если для доступа к определенному ресурсу требуется наличие аутентификации или наличие каких-то других условий, в зависимости от которых мы можем предоставить пользователю доступ, а можем и не предоставить. То есть guards защищают доступ к ресурсу, собственно поэтому данные элементы и названы так: \"guards\", что с английского можно перевести как \"защитники\".\nCanActivate\nCanActivate представляет один из типов guards, который позволяет управлять доступом к ресурсу при маршрутизации.",
        "image": ""
      },
      "authors": ["Разработчик: Димон Димыч", "Менеджер: Карина Кокс"],
      "departments": [
        "Отдел разработки 2"
      ],
      "tags": ["angular", "роутинг", "frontend"],
      "category": "Клиентская сторона"
    },
    {
      "id": 5,
      "title": "КПК не работает",
      "description": "Проблемы при попытке подключить к терминалу КПК с отсканированными товарами",
      "dateCreate": "1652443987256",
      "dateUpdate": "1652443995174",
      "content": {
        "text":  "После отсканирования целой кучи товаров на протяжении рабочего дня не могу передать данные с КПК на рабочий терминал.\n Эта проблема возникло под конец рабочей смены, соответственно, сотрудник не может нормально закончить рабочий день. Для решения проблемы обратитесь в отдел разработки 5",
        "image": ""
      },
      "authors": ["Разработчик: Макс Сыч", "Менеджер: Сережа Сережин"],
      "departments": [
        "Отдел разработки 2"
      ],
      "tags": ["Склад", "КПК", "терминал"],
      "category": "Склад"
    },
    {
      "id": 6,
      "title": "Нельзя выдать клиенту товар",
      "description": "Нельзя выдать клиенту товар без предоплаты",
      "dateCreate": "1652443987256",
      "dateUpdate": "1652443995174",
      "content": {
        "text":  "После отсканирования товара не могу выдать его клиенту.\n Программа выдает ошибку. Для решения проблемы обратитесь в отдел разработки 5",
        "image": ""
      },
      "authors": ["Разработчик: Ашот Монобровов", "Менеджер: Магомед Гамноедович"],
      "departments": [
        "Отдел разработки 5"
      ],
      "tags": ["Пункты выдачи", "интерфейс", "товары"],
      "category": "Пункты выдачи"
    }
]
